arpruss/koduino/stm32/boards.txt
# @authors Avik De <avikde@gmail.com>

# This file is part of koduino <https://github.com/avikde/koduino>

# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation, either
# version 3 of the License, or (at your option) any later version.

# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
# Lesser General Public License for more details.

# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, see <http://www.gnu.org/licenses/>.

menu.flashsize=Flash Size
menu.hse=CPU Speed
menu.bootloader=Bootloader

###########################################################

f301.name=F301/F302 (gRBL)
f301.build.mcu=STM32F302x8
f301.build.series=STM32F30x
f301.build.core=arduino
f301.build.extra_flags=
f301.build.ldscript=STM32F302R8_FLASH.ld
f301.build.variant=f301
f301.build.dependency=true
f301.build.isrs=CALL
f301.build.board=STM32_F301

# Flash size choices
f301.menu.flashsize.64k = 64KB (F30**8)
f301.menu.flashsize.64k.upload.maximum_size=61440
f301.menu.flashsize.64k.upload.eeplen=4096

f301.menu.flashsize.32k = 32KB (F30**6)
f301.menu.flashsize.32k.upload.maximum_size=28672
f301.menu.flashsize.32k.upload.eeplen=4096

# HSE choices
# f301.build.hse_value=8000000UL
# f301.build.clksrc=HSI

f301.menu.hse.hsi=48MHz (from HSI)
f301.menu.hse.hsi.build.hse_value=8000000UL
f301.menu.hse.hsi.build.f_cpu=48000000L
f301.menu.hse.hsi.build.clksrc=HSI

f301.menu.hse.8m=72MHz (from 8MHz HSE)
f301.menu.hse.8m.build.hse_value=8000000UL
f301.menu.hse.8m.build.f_cpu=72000000L
f301.menu.hse.8m.build.clksrc=HSE_8M

# f301.menu.hse.8m_oc96=96MHz (overclock from 8MHz HSE)
# f301.menu.hse.8m_oc96.build.hse_value=8000000UL
# f301.menu.hse.8m_oc96.build.f_cpu=96000000L
# f301.menu.hse.8m_oc96.build.clksrc=HSE_8M_OC96

# f301.menu.hse.8m_oc112=112MHz (overclock from 8MHz HSE)
# f301.menu.hse.8m_oc112.build.hse_value=8000000UL
# f301.menu.hse.8m_oc112.build.f_cpu=112000000L
# f301.menu.hse.8m_oc112.build.clksrc=HSE_8M_OC112

# Upload choices
# f301.upload.tool=stlink
# f301.upload.protocol=stlink
# f301.upload.maximum_size=49152

f301.menu.bootloader.stm32ld=Serial
f301.menu.bootloader.stm32ld.upload.tool=stm32ld
f301.menu.bootloader.stm32ld.upload.baud=230400
f301.menu.bootloader.stm32ld.upload.protocol=serial
f301.menu.bootloader.stm32ld.upload.options=mblc

f301.menu.bootloader.stlink=ST-LINK
f301.menu.bootloader.stlink.upload.tool=stlink
f301.menu.bootloader.stlink.upload.protocol=stlink
f301.menu.bootloader.stlink.upload.options=

# f301.menu.bootloader.stlinkur=ST-LINK (UR)
# f301.menu.bootloader.stlinkur.upload.tool=stlink
# f301.menu.bootloader.stlinkur.upload.protocol=stlink
# f301.menu.bootloader.stlinkur.upload.options=-c UR

f301.menu.bootloader.texanestlink=texane/stlink
f301.menu.bootloader.texanestlink.upload.tool=texanestlink
f301.menu.bootloader.texanestlink.upload.protocol=stlink
f301.menu.bootloader.texanestlink.upload.options=

# f301.menu.bootloader.dfu_util=DFU
# f301.menu.bootloader.dfu_util.upload.tool=dfu_util
# f301.menu.bootloader.dfu_util.upload.protocol=dfu


###########################################################

f303v.name=F303V (gRMb, F3 discovery)
f303v.build.mcu=STM32F303xC
f303v.build.series=STM32F30x
f303v.build.core=arduino
f303v.build.extra_flags=
f303v.build.ldscript=STM32F303VC_FLASH.ld
f303v.build.variant=f303v
f303v.build.isrs=INLINE
f303v.build.board=STM32_F303V

# To save EEPROM?
# Flash size choices
f303v.menu.flashsize.256ke = 252KB (2k EEPROM)
f303v.menu.flashsize.256ke.upload.maximum_size=258048
f303v.menu.flashsize.256ke.upload.eeplen=4096
# f303v.menu.flashsize.256k = 256KB (no EEPROM)
# f303v.menu.flashsize.256k.upload.maximum_size=262144
# f303v.menu.flashsize.256k.upload.eeplen=0

# HSE choices
f303v.menu.hse.8m=72MHz (from 8MHz HSE)
f303v.menu.hse.8m.build.hse_value=8000000UL
f303v.menu.hse.8m.build.f_cpu=72000000L
f303v.menu.hse.8m.build.clksrc=HSE_8M

# f303v.menu.hse.8m_oc96=96MHz (overclock from 8MHz HSE)
# f303v.menu.hse.8m_oc96.build.hse_value=8000000UL
# f303v.menu.hse.8m_oc96.build.f_cpu=96000000L
# f303v.menu.hse.8m_oc96.build.clksrc=HSE_8M_OC96

f303v.menu.hse.8m_oc112=112MHz (overclock from 8MHz HSE)
f303v.menu.hse.8m_oc112.build.hse_value=8000000UL
f303v.menu.hse.8m_oc112.build.f_cpu=112000000L
f303v.menu.hse.8m_oc112.build.clksrc=HSE_8M_OC112

# f303v.menu.bootloader.stm32ld=Serial (stm32ld)
# f303v.menu.bootloader.stm32ld.upload.tool=stm32ld
# f303v.menu.bootloader.stm32ld.upload.baud=230400
# f303v.menu.bootloader.stm32ld.upload.protocol=serial
# f303v.menu.bootloader.stm32ld.upload.options=mblc

f303v.menu.bootloader.stm32loader=Serial (stm32loader)
f303v.menu.bootloader.stm32loader.upload.tool=stm32loader
f303v.menu.bootloader.stm32loader.upload.baud=230400
f303v.menu.bootloader.stm32loader.upload.protocol=serial
f303v.menu.bootloader.stm32loader.upload.options=mblc

f303v.menu.bootloader.stlink=ST-LINK
f303v.menu.bootloader.stlink.upload.tool=stlink
f303v.menu.bootloader.stlink.upload.protocol=stlink
f303v.menu.bootloader.stlink.upload.options=

f303v.menu.bootloader.dfu_util=dfu-util
f303v.menu.bootloader.dfu_util.upload.tool=dfu_util
f303v.menu.bootloader.dfu_util.upload.protocol=dfu

###########################################################

f303c.name=f303c (gRMb, F3 discovery)
f303c.build.mcu=STM32F303xC
f303c.build.series=STM32F30x
f303c.build.core=arduino
f303c.build.extra_flags=
f303c.build.ldscript=STM32F303C_FLASH.ld
f303c.build.variant=f303c
f303c.build.isrs=INLINE
f303c.build.board=STM32_F303C

# Flash size choices
f303c.menu.flashsize.128k = 128KB
f303c.menu.flashsize.128k.upload.maximum_size=131072
f303c.menu.flashsize.128k.upload.eeplen=0

f303c.menu.flashsize.256k = 256KB
f303c.menu.flashsize.256k.upload.maximum_size=262144
f303c.menu.flashsize.256k.upload.eeplen=0

# HSE choices
f303c.menu.hse.8m=72MHz (from 8MHz HSE)
f303c.menu.hse.8m.build.hse_value=8000000UL
f303c.menu.hse.8m.build.f_cpu=72000000L
f303c.menu.hse.8m.build.clksrc=HSE_8M

# f303c.menu.hse.8m_oc96=96MHz (overclock from 8MHz HSE)
# f303c.menu.hse.8m_oc96.build.hse_value=8000000UL
# f303c.menu.hse.8m_oc96.build.f_cpu=96000000L
# f303c.menu.hse.8m_oc96.build.clksrc=HSE_8M_OC96

f303c.menu.hse.8m_oc112=112MHz (overclock from 8MHz HSE)
f303c.menu.hse.8m_oc112.build.hse_value=8000000UL
f303c.menu.hse.8m_oc112.build.f_cpu=112000000L
f303c.menu.hse.8m_oc112.build.clksrc=HSE_8M_OC112

# f303c.menu.bootloader.stm32ld=Serial (stm32ld)
# f303c.menu.bootloader.stm32ld.upload.tool=stm32ld
# f303c.menu.bootloader.stm32ld.upload.baud=230400
# f303c.menu.bootloader.stm32ld.upload.protocol=serial
# f303c.menu.bootloader.stm32ld.upload.options=mblc

f303c.menu.bootloader.stm32loader=Serial (stm32loader)
f303c.menu.bootloader.stm32loader.upload.tool=stm32loader
f303c.menu.bootloader.stm32loader.upload.baud=230400
f303c.menu.bootloader.stm32loader.upload.protocol=serial
f303c.menu.bootloader.stm32loader.upload.options=mblc

f303c.menu.bootloader.stlink=ST-LINK
f303c.menu.bootloader.stlink.upload.tool=stlink
f303c.menu.bootloader.stlink.upload.protocol=stlink
f303c.menu.bootloader.stlink.upload.options=

f303c.menu.bootloader.dfu_util=dfu-util
f303c.menu.bootloader.dfu_util.upload.tool=dfu_util
f303c.menu.bootloader.dfu_util.upload.protocol=dfu

###########################################################
f37x.name=F373
f37x.build.mcu=STM32F37x
f37x.build.series=STM32F37x
f37x.build.f_cpu=72000000L
# f37x.build.usb_product="M4"
# f37x.build.board=f37x
f37x.build.core=arduino
f37x.build.extra_flags=
f37x.build.ldscript=STM32_FLASH.ld
f37x.build.variant=f37x
f37x.build.board=STM32_F37X
f37x.build.isrs=INLINE

# HSE choices
f37x.menu.hse.8m=72MHz (from 8MHz HSE)
f37x.menu.hse.8m.build.hse_value=8000000UL
f37x.menu.hse.8m.build.f_cpu=72000000L
f37x.menu.hse.8m.build.clksrc=HSE_8M

f37x.menu.hse.16m=72MHz (from 16MHz HSE)
f37x.menu.hse.16m.build.hse_value=16000000UL
f37x.menu.hse.16m.build.f_cpu=72000000L
f37x.menu.hse.16m.build.clksrc=HSE_16M


f37x.upload.maximum_size=262144
f37x.upload.eeplen=0

# Upload choices
f37x.menu.bootloader.stm32loader=Serial (no pulse)
f37x.menu.bootloader.stm32loader.upload.tool=stm32loader
f37x.menu.bootloader.stm32loader.upload.protocol=serial
f37x.menu.bootloader.stm32loader.upload.options=none
f37x.menu.bootloader.stm32loader.upload.baud=230400

f37x.menu.bootloader.stm32loadermb=Serial (pulse DTR/RTS)
f37x.menu.bootloader.stm32loadermb.upload.tool=stm32loader
f37x.menu.bootloader.stm32loadermb.upload.protocol=serial
# f37x.upload.sequence=-rts,-dtr,dtr:rts,-dtr,dtr
f37x.menu.bootloader.stm32loadermb.upload.options=dtr_rts
f37x.menu.bootloader.stm32loadermb.upload.baud=230400

f37x.menu.bootloader.dfu_util=dfu-util
f37x.menu.bootloader.dfu_util.upload.tool=dfu_util
f37x.menu.bootloader.dfu_util.upload.protocol=dfu

# f37x.build.vid=0x2341
# f37x.build.pid=0x003e


###########################################################

f40_41x.name=F405
f40_41x.build.mcu=STM32F40_41xxx
f40_41x.build.series=STM32F4xx
f40_41x.build.f_cpu=168000000L
f40_41x.build.core=arduino
f40_41x.build.extra_flags=
f40_41x.build.ldscript=STM32F417IG_FLASH.ld
f40_41x.build.variant=f40_41x
f40_41x.build.board=STM32_F40_41X

# HSE choices
f40_41x.build.hse_value=16000000UL
f40_41x.build.clksrc=HSE_16M
f40_41x.build.isrs=INLINE

# Upload common
f40_41x.upload.baud=115200
f40_41x.upload.maximum_size=65536
f40_41x.upload.eeplen=0
f40_41x.upload.tool=stm32ld
f40_41x.upload.protocol=serial

# Upload choices
f40_41x.menu.bootloader.mbv2=RTS delay (MBv2)
# f40_41x.upload.sequence=-rts,-dtr,dtr:rts,-dtr,dtr
f40_41x.menu.bootloader.mbv2.upload.options=rts_trpl_inv

f40_41x.menu.bootloader.bootbut=Boot button
f40_41x.menu.bootloader.bootbut.upload.options=dtr_rts


###########################################################

f446.name=F446 (gRMbm)
f446.build.mcu=STM32F446xx
f446.build.series=STM32F4xx
f446.build.core=arduino
f446.build.extra_flags=
f446.build.ldscript=STM32F446ZE_FLASH.ld
f446.build.variant=f446
f446.build.isrs=INLINE
f446.build.board=STM32_F446

# HSE choices
f446.build.hse_value=8000000UL
f446.build.f_cpu=180000000L
f446.build.clksrc=

# Upload
f446.upload.maximum_size=524288
f446.upload.eeplen=0

f446.menu.bootloader.stm32ld=Serial (stm32ld)
f446.menu.bootloader.stm32ld.upload.tool=stm32ld
f446.menu.bootloader.stm32ld.upload.baud=230400
f446.menu.bootloader.stm32ld.upload.protocol=serial
f446.menu.bootloader.stm32ld.upload.options=mblc

f446.menu.bootloader.stm32loader=Serial (stm32loader)
f446.menu.bootloader.stm32loader.upload.tool=stm32loader
f446.menu.bootloader.stm32loader.upload.baud=230400
f446.menu.bootloader.stm32loader.upload.protocol=serial
f446.menu.bootloader.stm32loader.upload.options=mblc

f446.menu.bootloader.stlink=ST-LINK
f446.menu.bootloader.stlink.upload.tool=stlink
f446.menu.bootloader.stlink.upload.protocol=stlink
f446.menu.bootloader.stlink.upload.options=

f446.menu.bootloader.dfu_util=dfu-util
f446.menu.bootloader.dfu_util.upload.tool=dfu_util
f446.menu.bootloader.dfu_util.upload.protocol=dfu
